{
  "posts": [
    {
      "id": 1,
      "title": "超越代码的力量",
      "excerpt": "提到木酱老师，很多人对他的第一印象便是一位计算机技术高超的老师，以及他独特的教学方式。实际上，木酱老师还曾是阿里最年轻的技术专家，和一位致力于造福社会、富有创新力的的公益人。",
      "content": "# 超越代码的力量\n\n## ——记一位热衷公益的程序员蜕变成老师的故事\n\n&emsp;&emsp;提到木酱老师，很多人对他的第一印象便是一位计算机技术高超的老师，以及他独特的教学方式。实际上，木酱老师还曾是阿里最年轻的技术专家，和一位致力于造福社会、富有创新力的的公益人。今天，就让我们走进他的世界，看看这样一位热衷公益的程序员是如何蜕变成老师的。\n\n## 程序员是如何炼成的\n\n&emsp;&emsp;木酱老师与计算机的缘分要从小学说起。\n\n&emsp;&emsp;他到了小学开始玩CS（反恐精英），然后初中的时候他的爸爸给我买电脑，但是没有给我联网。所以他就只能连一些不能联网的东西，像一些设计软件，动画软件之类。他就开始玩起来了。\n\n&emsp;&emsp;这段经历对木酱后来最终选择程序员作为职业产生了很大的影响，也为他日后的计算机之路奠定了基础。\n\n&emsp;&emsp;高中时，木酱正式开始学习计算机编程。学习计算机并不容易，但是按照木酱老师的话说，学计算机\"很累也很难，但是也很有乐趣。\"\n\n&emsp;&emsp;面对困难，他并没有退缩，反而乐在其中。刚开始学习C++时，他感到困惑和迷茫，但他并没有放弃，而是每周都会抽出时间去新华书店寻找计算机方面的书籍。他阅读大量的书籍，并尝试着理解新知识。尽管困难重重，但每一次把\"未知的东西变成已知\"的喜悦都让他感到无比满足。\n\n&emsp;&emsp;然而，成为一名程序员并非木酱老师一开始就确定的方向。\n\n&emsp;&emsp;大学毕业后，他选择踏上了创业的征程，在创业的过程中，写方案和演讲虽然可以带来金钱，但让他感到疲惫不堪。与之相反，在创业过程中他发现自己对编程有着天赋和热爱。他自己在编程时能够全身心投入进去，也不会觉得疲惫，这使他逐渐确定了自己的职业方向。\n\n&emsp;&emsp;随着时间的推移，木酱老师逐渐成长为一名优秀的程序员，也完成了一些重要的成果。在游戏公司时，木酱完成了他最满意的作品——一个帮助公司更好的投放广告的数据分析工具。这个成果不仅帮助公司每天节省了高达几十万的成本费用，而且也让他自己深受鼓舞。\n\n&emsp;&emsp;后来他来到了阿里巴巴并成为了阿里最年轻的技术专家。他在阿里云开发的\"Data V\"对中国的大数据行业产生了深远影响，为企业提供了低成本的数据可视化解决方案。\"从我们产品发布之后，中国数据可视化行业就快速的就发展起来了，就基本上就到了人手一个的这样的水平。\"\n\n&emsp;&emsp;富有创兴精神，保持对生活的好奇心，坚持自己的理想，程序员就是这么炼成的。\n\n## 向天空出发\n\n&emsp;&emsp;\"我一开始是看到别人做公益，然后我也逐渐开始做公益，然后公益的方向也涉及很多，其实很多是机缘巧合的。从但是如果说从广泛的公益上面来说的话，其实我做的很早。\"谈及公益，木酱这么说道。\n\n&emsp;&emsp;从2011年开始，木酱就投身于公益事业，立志用自己的专业知识和技能改变人们的生活。他认为，公益行为，不一定是局限于帮助弱势群体，还可以是通过技术和知识分享来造福更多人。\n\n&emsp;&emsp;最初，木酱加入W3C的信息无障碍组织，并开始为国内的人翻译各种英文资料。这开始了他的公益之路。在这过程中，他逐渐意识到，知识和技术是可以成为改变人们生活的关键力量。于是，他开始积极参与各种公益项目，为弱势群体和乡村教育解决困难。\n\n&emsp;&emsp;木酱，作为阿里的乡村技术振兴官，在和另一位振兴官曹林老师合作时发现了中国乡村教育的一大问题：虽然小学教育质量很高，但科技教育却远远滞后于城市。因此，他们决定通过公益项目\"向天空出发\"，通过科普的方式，带领乡村孩子们探索星辰大海的奥秘，而这些公益活动也取得了比写代码更加强大的影响。\n\n&emsp;&emsp;通过开设课程，组织火箭发射、用天文望远镜观测天空等活动，他们让孩子们近距离感受到科技的魅力，激发了他们对科学的兴趣，为乡村学生带来了前所未有的奇妙体验。\n\n&emsp;&emsp;在谈及公益项目的收获时，木酱表示公益最大的价值在于让每个人都有机会真正地去帮助他人。这不仅对个人有重要意义，也对社会有益处。他认为，无论是做公益还是从事商业，只要让自己感受到\"予人玫瑰，手有余香\"，都是非常值得的。他也会在未来继续从事公益活动，并鼓励每个人尝试做一些力所能及的公益事业。这也与云谷所提倡的目标\"助益世界的创新者\"一脉相承。\n\n## 玩点真东西\n\n&emsp;&emsp;从一开始，木酱就对教育行业充满向往。他认为，\"教育是一项特别的事业，因为它可以让人一生受益，也是社会永远都需要的。\"对他来说，教育不仅是一种职业选择，更是一种使命和责任。全面发展的确值得提倡，但这样的观念常常会让一些有特长但不善于应试的学生被边缘化，而木酱认为这并不是衡量一个人能力的唯一标准。他认为，很多人之所以不能在他们擅长的领域有所作为，是因为教育体系的局限性。\"我非常希望能多少做一些贡献，能够改变一点点，所以我就来到云谷。\"木酱这么说道。\n\n&emsp;&emsp;在云谷学校，木酱教授计算机科学相关的课程，例如ICT和计算机科学原理。他的教学风格与众不同，主张\"玩点真东西\"。\n\n&emsp;&emsp;在与学生的互动中，木酱始终强调灵活性和实践性。他鼓励学生自己动手去实践，去解决问题，而不是只是被动的接受知识。他致力于给学生提供真实的体验和案例，而不仅仅是理论知识的灌输，这远比仅仅记住代码更加重要。\n\n&emsp;&emsp;在教授计算机网络原理时，他不仅告诉学生网络的七层结构和各层的功能，还会让他们理解每一层背后的逻辑和解决的问题。通过实际操作和案例分析，学生可以更加深入地理解知识，并且能够灵活运用。木酱相信，只有真正理解了知识的本质和应用，学生才能在未来的发展中做出更好的选择和创新。\n\n&emsp;&emsp;一位喜欢玩点真东西的云谷计算机老师，一位富有创新传播知识的爱心公益人。这就是木酱。他不仅传授了技术，更是点燃了学生内心的火焰，让他们敢于追求梦想，勇于创造未来，创造出了超越代码的力量。愿我们都能像木酱老师一样，用自己的力量去点亮别人的人生，做\"助益世界的创新者\"，让世界因我们的存在而变得更加美好。",
      "date": "2024-12-25",
      "category": "人物故事",
      "tags": ["教育", "公益", "程序员", "人物专访"]
    },
    {
      "id": 2,
      "title": "阿里巴巴庆祝奥林匹克日",
      "excerpt": "全球奥林匹克合作伙伴阿里巴巴通过一系列全球活动庆祝今年的奥林匹克日，鼓励员工积极参与并与奥林匹克价值观建立联系。",
      "content": "# 阿里巴巴庆祝奥林匹克日\n\n## ——通过全球活动推广健身、包容性和创新\n\n&emsp;&emsp;全球奥林匹克合作伙伴阿里巴巴通过在其全球办公室举办的一系列活动庆祝今年的奥林匹克日，鼓励员工积极参与并与奥林匹克价值观建立联系。\n\n## 杭州：与机器人一起奔跑\n\n&emsp;&emsp;在阿里巴巴杭州总部，超过2000名员工、家属和嘉宾在新落成的奥林匹克主题运动场参加了3.5公里跑步活动。此次活动还特别邀请了15个由阿里巴巴云技术开发的AI机器人，它们与参与者一起奔跑，展示了人工智能在体育领域的新应用。\n\n&emsp;&emsp;这次跑步活动设计得非常包容，超过200名残障人士——包括视障、听障、肢体障碍和自闭症参与者——在公司志愿者的支持下参加了活动，确保每个人都能完成赛程。\n\n## 全球办公室的多样活动\n\n&emsp;&emsp;除了杭州的旗舰活动外，阿里巴巴全球60个办公室的员工还参加了各种奥林匹克主题挑战，包括瑜伽课程、乒乓球比赛和力量训练。在2026年米兰科尔蒂纳冬奥会主办城市米兰，当地团队欢迎吉祥物Milo和Tina参加了一场晨间瑜伽活动，米兰科尔蒂纳2026年组委会的成员也出席了活动。\n\n&emsp;&emsp;除了线下活动，阿里巴巴还推出了多项数字倡议来促进健康和福祉。其中包括\"AI马拉松\"，邀请员工使用生成式AI工具将个人照片转换为以运动为主题的短视频。\n\n## 步行挑战：连接全球的公益行动\n\n&emsp;&emsp;公司还通过\"步行挑战\"向公众开放参与，该活动从6月10日持续到7月10日，邀请人们通过在线平台记录每日步数来获得虚拟\"奖牌\"。每一步都为中国农村儿童建设足球设施的筹款活动做出贡献。截至目前，已有超过230万人参与，记录了超过8亿步。\n\n&emsp;&emsp;这个数字不仅体现了活动的广泛影响力，更展现了科技如何将全球各地的人们连接起来，共同为一个有意义的目标而努力。通过简单的步行行为，参与者不仅改善了自己的健康状况，也为改善农村儿童的运动条件贡献了力量。\n\n## 科技与体育的完美融合\n\n&emsp;&emsp;15个AI机器人的参与为活动增添了未来感，展示了阿里巴巴在人工智能和云计算领域的技术实力。这些机器人不仅与参与者一起奔跑，更象征着科技与体育的深度融合，预示着未来体育发展的新方向。\n\n&emsp;&emsp;通过AI技术，阿里巴巴不仅提升了活动的趣味性和互动性，也向世界展示了中国科技企业在推动体育创新方面的努力和成果。\n\n## 包容性的实践\n\n&emsp;&emsp;超过200名残障人士的参与，充分体现了阿里巴巴对包容性的重视。通过志愿者的支持和无障碍设计，活动确保了每个人都能平等参与，真正践行了\"更快、更高、更强——更团结\"的奥林匹克精神。\n\n&emsp;&emsp;这种包容性的实践不仅体现在活动中，也反映了阿里巴巴作为企业公民的社会责任感。通过创造无障碍的参与环境，阿里巴巴为其他企业树立了良好的榜样。\n\n## 展望未来\n\n&emsp;&emsp;自2017年成为全球奥林匹克合作伙伴以来，阿里巴巴一直致力于支持奥运会的数字化转型和相关倡议。今年的奥林匹克日庆祝活动再次证明了阿里巴巴在推动体育发展、促进社会包容和科技创新方面的承诺。\n\n&emsp;&emsp;奥林匹克日是全球性的体育和健身庆祝活动，每年6月23日举行，以纪念1894年国际奥委会成立的日子——现代奥林匹克运动的诞生。通过这样的庆祝活动，阿里巴巴不仅与员工和公众分享了奥林匹克精神，也为推动全球体育事业的发展贡献了自己的力量。",
      "date": "2025-06-24",
      "category": "企业动态",
      "tags": ["阿里巴巴", "奥林匹克", "体育", "科技创新", "AI"]
    },
    {
      "id": 3,
      "title": "响应式设计最佳实践",
      "excerpt": "分享响应式 Web 设计的最佳实践和技巧。",
      "content": "响应式设计是现代 Web 开发的重要技能。\n\n## 响应式设计原则\n\n- 移动优先：从移动设备开始设计\n- 弹性布局：使用 CSS Grid 和 Flexbox\n- 媒体查询：针对不同屏幕尺寸调整样式\n\n## 实践技巧\n\n1. 使用相对单位（rem, em, %）\n2. 优化图片和媒体资源\n3. 测试不同设备和浏览器\n\n响应式设计确保了网站在各种设备上都能提供良好的用户体验。",
      "date": "2024-02-20",
      "category": "设计",
      "tags": ["响应式设计", "CSS", "用户体验"]
    }
  ]
}

