{
  "posts": [
    {
      "id": 1,
      "title": "Getting Started with Vue.js",
      "excerpt": "An introductory guide to Vue.js for beginners.",
      "content": "Vue.js is a progressive JavaScript framework for building user interfaces.\\n\\nThe core library focuses on the view layer only, making it easy to pick up and integrate with other libraries.\\n\\n## Why Vue.js?\\n\\n- Easy to learn: clean API and gentle learning curve\\n- Great performance: virtual DOM and reactivity system\\n- Rich ecosystem with strong community support\\n\\n## Getting Started\\n\\nYou can import Vue.js via CDN or install it via npm.\\n\\nVue.js makes frontend development simpler and more efficient.",
      "date": "2024-01-15",
      "category": "Frontend",
      "tags": ["Vue.js", "JavaScript", "Frontend"]
    },
    {
      "id": 2,
      "title": "Understanding Vite",
      "excerpt": "Explore the features and usage of Vite.",
      "content": "Vite is a next-generation frontend build tool created by the author of Vue.js.\\n\\n## Advantages of Vite\\n\\n1. **Blazing fast dev server** using native ES modules\\n2. **Fast HMR** updates only the changed modules\\n3. **Optimized production build** powered by Rollup with code splitting\\n\\n## Experience\\n\\nUsing Vite delivers a smooth development experience and significantly improves productivity.",
      "date": "2024-02-01",
      "category": "Tooling",
      "tags": ["Vite", "Build tool", "Engineering"]
    },
    {
      "id": 3,
      "title": "Responsive Design Best Practices",
      "excerpt": "Best practices and tips for responsive web design.",
      "content": "Responsive design is a crucial skill in modern web development.\\n\\n## Principles\\n\\n- Mobile-first\\n- Flexible layouts with CSS Grid and Flexbox\\n- Media queries for different screen sizes\\n\\n## Tips\\n\\n1. Use relative units (rem, em, %)\\n2. Optimize images and media\\n3. Test across devices and browsers",
      "date": "2024-02-20",
      "category": "Design",
      "tags": ["Responsive", "CSS", "UX"]
    },
    {
      "id": 4,
      "title": "SHM Project PCB Iteration Report",
      "excerpt": "A detailed report on the iterative design process of the F-18 cockpit control PCB, addressing circuit design challenges and DCS BIOS integration issues.",
      "content": "**Authors:** Tyler, Eric\\n**Programming CCA**\\n**21 December 2024**\\n\\n# SHM Project PCB Iteration Report\\n\\n## Introduction\\n\\nIn last year's F-18 project, we used a breadboard-based setup with external wiring. During the final validation phase, we failed to establish successful interaction with DCS BIOS. Considering the need for greater convenience and easier troubleshooting, we came up with the idea of designing a custom PCB (printed circuit board) integrated circuit.\\n\\n## Initial Ver. PCB\\n\\n![SHM1](/SHM1.png)\\n\\n### Content Overview:\\n\\n1. Instead of connecting each pin of the buttons with individual wires, we integrated the buttons directly onto the PCB, so that wires only need to be connected to the designated signal transmission and detection pins.\\n\\n2. We implemented GND copper pour across the board, reducing wiring clutter and improving electrical stability.\\n\\n3. A 1x5 pin header is arranged on each of the four sides, ensuring consistent and organized wiring on every edge, minimizing fragmentation and making modifications more convenient.\\n\\n### Test Results:\\n\\nThe PCB did not meet our expectations and, similarly, failed to interact with DCS. Iteration and further refinement are required.\\n\\n## First Iteration\\n\\n### Problem Identification:\\n\\nDuring the first iteration, we revisited the circuit board designed last semester and found that it failed to meet the expected requirements during the final validation phase. Through detailed analysis, we identified three main design flaws:\\n\\n1. **Disorganized Component Layout:** All connection ports were placed on the front side of the circuit board, which prevented the proper installation of the enclosure, compromised the overall system stability, and made operation inconvenient.\\n\\n2. **Chaotic Wiring Arrangement:** The routing of traces and placement of connectors were negatively affecting both the circuit board's performance and the assembly process.\\n\\n3. **Failure to Communicate with DCS BIOS:** We initially hypothesized that excessive resistance in the circuit caused the signal strength to drop below the threshold required for the game to detect, preventing successful interaction.\\n\\n### Improvement Plan:\\n\\nTo address these issues, we implemented the following design modifications:\\n\\n1. **Component Relocation:** All components were moved to the back side of the PCB, ensuring that the front side remains free of obstructions. This allows the enclosure to be properly installed and improves both system stability and usability.\\n\\n2. **Power Plane Copper Pour:** We replaced traditional wiring with copper pour for power distribution, simplifying the design and enhancing electrical stability. This approach is particularly effective for 5V and GND routing, improving efficiency during assembly and usage. It also eliminates the common issue of wires detaching from pin headers.\\n\\n3. **Redesign of Button Module Layout:** We optimized the structure of the button units by removing the individual resistors connected to the negative terminals of the LEDs. Instead, we connected all buttons and ground lines in series. By leveraging the internal resistance of the buttons in combination with a single pull-down resistor, we significantly reduced component count, improved functionality and reliability, and made PCB assembly much more efficient and convenient.\\n\\n![SHM2](/SHM2.png)\\n\\n### Test Results:\\n\\nAfter testing, PCB 1.0 still failed to communicate with DCS BIOS, indicating that issues persist and further iteration is required.\\n\\n## Second Iteration\\n\\n### Problem Identification:\\n\\nDuring the second iteration, we further refined the circuit board design. Although the first iteration resolved some issues, during the assembly and testing phase, we identified significant flaws in PCB 2.0. After troubleshooting with a multimeter performed by a classmate, we pinpointed the root cause of PCB 1.0's failure: the buttons were malfunctioning. In addition to this critical issue, we also addressed several design flaws in the 1.0 version that had previously gone unnoticed:\\n\\n1. **5V and GND Not Properly Connected to the Chip:** There was no direct connection between the power pads (5V and GND) on the PCB and the microcontroller chip, resulting in the circuit failing to power correctly and operate as intended.\\n\\n2. **Buttons Not Functioning:** The button signal lines were incorrectly tied directly to 5V, causing them to remain in a permanently \\\"on\\\" state. As a result, pressing the buttons did not produce a detectable change in signal, making it impossible for the system to register user input.\\n\\n### Improvement Plan:\\n\\nTo address these issues, we implemented the following improvements:\\n\\n1. **Added Power Connection Interfaces:** We added four additional connection points between the 5V/GND pads and the microcontroller chip on the PCB. This ensures a stable power supply and improves reliability— even if one connection fails, the remaining three can still maintain proper functionality.\\n\\n2. **Major Redesign of Button Module Structure:** We completely restructured the button module's layout and wiring configuration to ensure accurate signal response. The revised design eliminates the previous short-circuit issue and allows each button to generate a clear on/off signal when pressed, enabling reliable detection by the system. (As shown in the figure below)\\n\\n![SHM3](/SHM3.png)\\n\\n3. **Redesign of Wiring and Interface Layout:** We again planned the routing and placement of interfaces on the PCB. The original 1x5 pin headers were replaced with 2x5 headers to improve connection stability and reduce space usage. Additionally, we changed the layout of the pin headers from being concentrated on the top edge of the PCB to a corner-distributed arrangement—placing one at each of the four corners. This minimizes cable congestion at the top, improves spatial organization, and enhances overall assembly efficiency. (As shown in the figure below)\\n\\n![SHM4](/SHM4.png)\\n\\n### Test Results:\\n\\nWe observed signal output on the Arduino; however, the PCB still failed to establish communication with DCS BIOS. Further improvements and debugging are required.\\n\\n## Third Iteration\\n\\n### Problem Identification:\\n\\nIn previous testing, we observed signal output on the Arduino, yet the system still failed to communicate with DCS BIOS. Based on this behavior, we have two hypotheses:\\n\\n1. **Incorrect Button Configuration:** DCS BIOS requires buttons to be set up in a pull-up configuration, but our current circuit uses a pull-down design, which may prevent proper signal interpretation by the software.\\n\\n2. **Potential Firmware Error:** The code uploaded to the microcontroller may be incorrect or improperly configured, causing DCS BIOS to fail in recognizing the incoming signals.\\n\\n### Improvement Plan:\\n\\n1. Use a breadboard to build a simple button circuit and test it with the preset code provided in the Arduino library, simulating the expected signal behavior for DCS BIOS.\\n\\n2. If the test shows that DCS successfully recognizes the button inputs, the issue likely lies in the firmware. In this case, we will consult official documentation and online resources to revise the microcontroller code accordingly.\\n\\n3. If DCS still fails to detect the signals, we will redesign the button circuit on the PCB using a pull-up configuration as required by DCS BIOS. Additionally, we will add a single large resistor in series with the entire button group to limit current flow, reducing the risk of damaging the buttons or the microcontroller and improving overall circuit reliability.\\n\\n## Conclusion\\n\\nThrough two rounds of iteration, we addressed several critical issues in the PCB design, significantly improving its functionality, reliability, and ease of assembly. The first iteration focused on optimizing component placement and implementing power plane copper pour to enhance stability and reduce wiring complexity. The second iteration resolved key structural flaws, including the lack of proper 5V/GND connections to the microcontroller and the malfunctioning button circuitry.\\n\\nDespite these improvements, the current version of the PCB still fails to communicate with DCS BIOS, indicating that further refinement is necessary. While we have made substantial progress in both design and troubleshooting, achieving full compatibility requires continued investigation—particularly into the button configuration (pull-up vs. pull-down) and firmware correctness. This project has reinforced the importance of iterative development, systematic testing, and attention to both hardware and software integration. We will continue to refine the design in pursuit of a fully functional and robust solution.\\n\\n## References\\n\\n- https://docs.arduino.cc/libraries/dcs-bios/\\n- https://www.youtube.com/watch?v=ia-m6fQU8SQ",
      "date": "2024-12-21",
      "category": "Hardware",
      "tags": ["PCB", "Arduino", "Hardware Design", "DCS BIOS", "Electronics"]
    }
  ]
}

